# üõí E-commerce SQL Practice Problems

This notebook contains 15 SQL problems based on an e-commerce database.

## Database Schema

| Table | Columns |
|-------|----------|
| **categories** | category_id, category_name, description |
| **products** | product_id, product_name, category_id, price, stock_quantity, created_at |
| **customers** | customer_id, first_name, last_name, email, city, country, registration_date |
| **orders** | order_id, customer_id, order_date, status, total_amount |
| **order_items** | item_id, order_id, product_id, quantity, unit_price |
| **reviews** | review_id, product_id, customer_id, rating, review_text, review_date |

## Setup - Run This First!

In [15]:
import sqlite3
import pandas as pd

# Connect to the database
conn = sqlite3.connect('ecommerce.db')

# Helper function to run queries
def run_query(query):
    return pd.read_sql_query(query, conn)

print("‚úÖ Connected to ecommerce.db successfully!")

‚úÖ Connected to ecommerce.db successfully!

## Explore the Database

In [16]:
# View all tables
run_query("SELECT name FROM sqlite_master WHERE type='table'")

              name
0       categories
1  sqlite_sequence
2         products
3        customers
4           orders
5      order_items
6          reviews

In [17]:
# Preview products table
run_query("SELECT * FROM products LIMIT 5")

,product_id,product_name,category_id,price,stock_quantity,created_at
0,1,iPhone 15 Pro,1,999.99,50,2026-01-23 07:35:22
1,2,Samsung Galaxy S24,1,899.99,45,2026-01-23 07:35:22
2,3,Sony WH-1000XM5 Headphones,1,349.99,100,2026-01-23 07:35:22
3,4,"MacBook Pro 14""",1,1999.99,30,2026-01-23 07:35:22
4,5,iPad Air,1,599.99,75,2026-01-23 07:35:22

In [18]:
# Preview customers table
run_query("SELECT * FROM customers LIMIT 5")

,customer_id,first_name,last_name,email,city,country,registration_date
0,1,John,Smith,john.smith@email.com,New York,USA,2023-01-15
1,2,Emily,Johnson,emily.j@email.com,Los Angeles,USA,2023-02-20
2,3,Michael,Williams,michael.w@email.com,Chicago,USA,2023-03-10
3,4,Sarah,Brown,sarah.b@email.com,Houston,USA,2023-04-05
4,5,David,Jones,david.j@email.com,Phoenix,USA,2023-05-12

In [70]:
# Preview orders table
run_query("SELECT * FROM orders LIMIT 5")

   order_id  customer_id           order_date     status  total_amount
0         1            1  2024-01-05 10:30:00  Delivered       1149.98
1         2            2  2024-01-08 14:15:00  Delivered        349.99
2         3            3  2024-01-10 09:00:00  Delivered        239.98
3         4            4  2024-01-12 16:45:00    Shipped        999.99
4         5            5  2024-01-15 11:20:00  Delivered        179.97

In [35]:
run_query('SELECT * FROM categories')

   category_id           category_name                           description
0            1             Electronics        Electronic devices and gadgets
1            2                Clothing             Apparel and fashion items
2            3          Home & Kitchen     Home decor and kitchen appliances
3            4                   Books            Physical and digital books
4            5       Sports & Outdoors     Sports equipment and outdoor gear
5            6  Beauty & Personal Care  Cosmetics and personal care products
6            7            Toys & Games                  Toys and board games

In [72]:
run_query('SELECT * FROM order_items limit 5')

   item_id  order_id  product_id  quantity  unit_price
0        1         1           1         1      999.99
1        2         1           6         1      150.00
2        3         2           3         1      349.99
3        4         3           6         1      150.00
4        5         3           7         1       89.99

In [73]:
run_query('SELECT * FROM reviews LIMIT 5')

,review_id,product_id,customer_id,rating,review_text,review_date
0,1,1,1,5,Amazing phone! Best purchase ever.,2024-01-20
1,2,1,4,4,Great phone but battery could be better.,2024-01-25
2,3,2,2,5,Excellent Samsung device!,2024-02-01
3,4,3,3,5,Best headphones I have ever owned.,2024-01-15
4,5,4,9,4,Powerful laptop for work.,2024-03-01

---
# üìù SQL Problems
---

## Problem 1: Basic SELECT ‚≠ê Easy

**Retrieve all product names and their prices from the `products` table, sorted by price from highest to lowest.**

In [20]:
# YOUR ANSWER HERE
query_1 = """
SELECT * FROM products
ORDER BY price DESC
"""
run_query(query_1)

,product_id,product_name,category_id,price,stock_quantity,created_at
0,4,"MacBook Pro 14""",1,1999.99,30,2026-01-23 07:35:22
1,1,iPhone 15 Pro,1,999.99,50,2026-01-23 07:35:22
2,2,Samsung Galaxy S24,1,899.99,45,2026-01-23 07:35:22
3,13,Dyson V15 Vacuum,3,749.99,35,2026-01-23 07:35:22
4,5,iPad Air,1,599.99,75,2026-01-23 07:35:22
5,25,Mountain Bike,5,599.99,25,2026-01-23 07:35:22
6,3,Sony WH-1000XM5 Headphones,1,349.99,100,2026-01-23 07:35:22
7,12,KitchenAid Mixer,3,349.99,40,2026-01-23 07:35:22
8,9,North Face Jacket,2,250.00,80,2026-01-23 07:35:22
9,14,Nespresso Machine,3,199.99,55,2026-01-23 07:35:22
10,24,Camping Tent 4-Person,5,199.99,45,2026-01-23 07:35:22
11,8,Adidas Ultraboost,2,180.00,120,2026-01-23 07:35:22
12,31,LEGO Star Wars Set,7,159.99,60,2026-01-23 07:35:22
13,6,Nike Air Max 270,2,150.00,200,2026-01-23 07:35:22
14,29,Hair Dryer Pro,6,149.99,70,2026-01-23 07:35:22
15,15,Air Fryer Pro,3,129.99,90,2026-01-23 07:35:22
16,23,Running Shoes Pro,5,129.99,80,2026-01-23 07:35:22
17,7,Levi's 501 Jeans,2,89.99,150,2026-01-23 07:35:22
18,11,Instant Pot Duo,3,89.99,60,2026-01-23 07:35:22
19,28,Perfume Collection,6,89.99,100,2026-01-23 07:35:22
20,22,Dumbbells Set 20kg,5,79.99,100,2026-01-23 07:35:22
21,30,Skincare Set,6,79.99,120,2026-01-23 07:35:22
22,32,PlayStation 5 Controller,7,69.99,150,2026-01-23 07:35:22
23,34,Nintendo Switch Games,7,59.99,180,2026-01-23 07:35:22
24,21,Yoga Mat Premium,5,49.99,150,2026-01-23 07:35:22
25,35,Remote Control Car,7,49.99,100,2026-01-23 07:35:22
26,10,Calvin Klein T-Shirt,2,45.00,300,2026-01-23 07:35:22
27,20,Clean Code,4,44.99,180,2026-01-23 07:35:22
28,18,Python Crash Course,4,39.99,200,2026-01-23 07:35:22
29,26,Vitamin C Serum,6,29.99,200,2026-01-23 07:35:22
30,33,Monopoly Board Game,7,29.99,200,2026-01-23 07:35:22
31,27,Face Moisturizer,6,24.99,250,2026-01-23 07:35:22
32,17,Atomic Habits,4,16.99,400,2026-01-23 07:35:22
33,19,The Midnight Library,4,15.99,350,2026-01-23 07:35:22
34,16,The Great Gatsby,4,14.99,500,2026-01-23 07:35:22

## Problem 2: Filtering with WHERE ‚≠ê Easy

**Find all customers who are from the USA.**

In [21]:
# YOUR ANSWER HERE
query_2 = """
SELECT * 
FROM customers
WHERE country = 'USA'
"""
run_query(query_2)

,customer_id,first_name,last_name,email,city,country,registration_date
0,1,John,Smith,john.smith@email.com,New York,USA,2023-01-15
1,2,Emily,Johnson,emily.j@email.com,Los Angeles,USA,2023-02-20
2,3,Michael,Williams,michael.w@email.com,Chicago,USA,2023-03-10
3,4,Sarah,Brown,sarah.b@email.com,Houston,USA,2023-04-05
4,5,David,Jones,david.j@email.com,Phoenix,USA,2023-05-12
5,6,Jessica,Garcia,jessica.g@email.com,Philadelphia,USA,2023-06-18
6,7,Christopher,Martinez,chris.m@email.com,San Antonio,USA,2023-07-22
7,8,Amanda,Robinson,amanda.r@email.com,San Diego,USA,2023-08-30
8,9,Daniel,Clark,daniel.c@email.com,Dallas,USA,2023-09-14
9,10,Ashley,Rodriguez,ashley.r@email.com,San Jose,USA,2023-10-25

## Problem 3: LIKE Operator ‚≠ê Easy

**Find all products that have the word "Pro" anywhere in their name.**

In [22]:
# YOUR ANSWER HERE
query_3 = """
SELECT *
FROM customers
WHERE first_name LIKE '%Pro%';
"""
run_query(query_3)

Empty DataFrame
Columns: [customer_id, first_name, last_name, email, city, country, registration_date]
Index: []

## Problem 4: Aggregate Functions (COUNT) ‚≠ê Easy

**Count the total number of orders in the database.**

In [23]:
# YOUR ANSWER HERE
query_4 = """

select count(order_id) as total_orders
from orders
where status = 'Delivered'

"""
run_query(query_4)

   total_orders
0            17

## Problem 5: Aggregate Functions (SUM & AVG) ‚≠ê Easy

**Calculate the total revenue (sum of total_amount) and average order value from all orders that have been delivered.**

In [ ]:

query_5 = """
SELECT 
sum(total_amount) as total_sales,
avg(total_amount) as avg_sales
from orders
where status = 'Delivered'

"""
run_query(query_5)

   total_sales   avg_sales
0      6644.74  390.867059

## Problem 6: GROUP BY  Medium

**Count how many products exist in each category. Display the category name and the count, sorted by count in descending order.**

In [37]:

query_6 = """
SELECT 
    c.category_name,
    count(p.product_id) as product_count

FROM products p
JOIN categories c
    ON p.category_id = c.category_id
GROUP BY c.category_name
"""
run_query(query_6)

            category_name  product_count
0  Beauty & Personal Care              5
1                   Books              5
2                Clothing              5
3             Electronics              5
4          Home & Kitchen              5
5       Sports & Outdoors              5
6            Toys & Games              5

## Problem 7: HAVING Clause ‚≠ê‚≠ê Medium

**Find all customers who have placed more than 2 orders. Display the customer's full name and their order count.**

In [55]:
# YOUR ANSWER HERE
query_7 = """
SELECT
    o.customer_id,
    c.first_name,
    c.last_name,
    COUNT(o.order_id) AS total_orders
FROM customers c
JOIN orders o
    ON o.customer_id = c.customer_id
WHERE o.status = 'Delivered'
GROUP BY
    o.customer_id,
    c.first_name,
    c.last_name
HAVING COUNT(o.order_id) > 1
ORDER BY total_orders DESC;

"""
run_query(query_7)

   customer_id first_name last_name  total_orders
0            1       John     Smith             2
1            3    Michael  Williams             2

## Problem 8: JOIN Operations ‚≠ê‚≠ê Medium

**List all orders with the customer's full name, order date, and order status. Sort by order date (most recent first).**

In [ ]:
# YOUR ANSWER HERE
query_8 = """
SELECT 
    c.first_name,
    c.last_name,
    o.order_date,
    o.status
FROM customers c
JOIN orders o
    on o.customer_id = c.customer_id
ORDER BY order_date DESC
"""
run_query(query_8)

     first_name  last_name           order_date      status
0        Daniel      Clark  2024-03-20 14:15:00  Processing
1        Amanda   Robinson  2024-03-18 11:30:00   Delivered
2   Christopher   Martinez  2024-03-15 15:00:00   Cancelled
3       Jessica     Garcia  2024-03-12 09:45:00   Delivered
4         David      Jones  2024-03-10 13:00:00     Shipped
5         Sarah      Brown  2024-03-08 16:15:00   Delivered
6       Michael   Williams  2024-03-05 10:30:00   Delivered
7         Emily    Johnson  2024-03-03 14:45:00     Pending
8          John      Smith  2024-03-01 11:00:00  Processing
9           Mia      Baker  2024-02-25 09:15:00   Delivered
10    Alexander      Green  2024-02-22 12:30:00     Shipped
11     Isabella      Scott  2024-02-20 14:00:00   Delivered
12     Benjamin     Wright  2024-02-18 10:45:00  Processing
13       Sophia       King  2024-02-15 15:30:00   Delivered
14      William      Young  2024-02-12 13:00:00   Delivered
15         Emma      Allen  2024-02-10 09:20:00     Pending
16       Robert       Hall  2024-02-08 11:45:00     Shipped
17       Olivia     Walker  2024-02-05 16:00:00   Delivered
18        James        Lee  2024-02-03 10:15:00   Delivered
19       Ashley  Rodriguez  2024-02-01 14:30:00   Cancelled
20       Daniel      Clark  2024-01-28 12:00:00   Delivered
21       Amanda   Robinson  2024-01-25 09:30:00     Shipped
22  Christopher   Martinez  2024-01-22 15:45:00   Delivered
23      Jessica     Garcia  2024-01-20 10:00:00  Processing
24         John      Smith  2024-01-18 13:30:00   Delivered
25        David      Jones  2024-01-15 11:20:00   Delivered
26        Sarah      Brown  2024-01-12 16:45:00     Shipped
27      Michael   Williams  2024-01-10 09:00:00   Delivered
28        Emily    Johnson  2024-01-08 14:15:00   Delivered
29         John      Smith  2024-01-05 10:30:00   Delivered

## Problem 9: Multiple JOINs ‚≠ê‚≠ê Medium

**Display all order items with the product name, quantity ordered, and the customer's email who placed the order.**

In [79]:
# YOUR ANSWER HERE
query_9 = """
  SELECT 
    c.first_name, 
    c.last_name,
    sum(oi.quantity) as ordered, 
    c.email
  FROM customers c
  JOIN orders o
    on o.customer_id = c.customer_id
  JOIN order_items oi
    on oi.order_id = o.order_id
  GROUP BY
      c.first_name,
      c.last_name,
      c.email
   Order BY
      ordered DESC
"""
run_query(query_9)

     first_name  last_name  ordered                 email
0         David      Jones        6     david.j@email.com
1          John      Smith        5  john.smith@email.com
2           Mia      Baker        5   mia.baker@email.com
3        Daniel      Clark        4    daniel.c@email.com
4         Emily    Johnson        3     emily.j@email.com
5       Jessica     Garcia        3   jessica.g@email.com
6       Michael   Williams        3   michael.w@email.com
7        Amanda   Robinson        2    amanda.r@email.com
8      Benjamin     Wright        2  ben.wright@email.com
9   Christopher   Martinez        2     chris.m@email.com
10     Isabella      Scott        2  isabella.s@email.com
11        Sarah      Brown        2     sarah.b@email.com
12      William      Young        2   william.y@email.com
13    Alexander      Green        1      alex.g@email.com
14       Ashley  Rodriguez        1    ashley.r@email.com
15         Emma      Allen        1      emma.a@email.com
16        James        Lee        1   james.lee@email.com
17       Olivia     Walker        1    olivia.w@email.com
18       Robert       Hall        1    robert.h@email.com
19       Sophia       King        1    sophia.k@email.com

## Problem 10: LEFT JOIN ‚≠ê‚≠ê Medium

**Find all products that have never been ordered. Display the product name and category name.**

In [85]:
# YOUR ANSWER HERE
query_10 = """

    SELECT p.*
    FROM products p
    LEFT JOIN order_items oi
     on p.product_id = oi.product_id
    WHERE oi.product_id is NULL


"""
run_query(query_10)

,product_id,product_name,category_id,price,stock_quantity,created_at
0,10,Calvin Klein T-Shirt,2,45.00,300,2026-01-23 07:35:22
1,16,The Great Gatsby,4,14.99,500,2026-01-23 07:35:22
2,19,The Midnight Library,4,15.99,350,2026-01-23 07:35:22
3,20,Clean Code,4,44.99,180,2026-01-23 07:35:22
4,23,Running Shoes Pro,5,129.99,80,2026-01-23 07:35:22
5,24,Camping Tent 4-Person,5,199.99,45,2026-01-23 07:35:22
6,25,Mountain Bike,5,599.99,25,2026-01-23 07:35:22
7,28,Perfume Collection,6,89.99,100,2026-01-23 07:35:22
8,29,Hair Dryer Pro,6,149.99,70,2026-01-23 07:35:22
9,30,Skincare Set,6,79.99,120,2026-01-23 07:35:22
10,32,PlayStation 5 Controller,7,69.99,150,2026-01-23 07:35:22
11,35,Remote Control Car,7,49.99,100,2026-01-23 07:35:22

In [87]:
# YOUR ANSWER HERE
query_10 = """

SELECT *
FROM products p
WHERE NOT EXISTS (
    SELECT 1
    FROM order_items oi
    WHERE oi.product_id = p.product_id
)

"""
run_query(query_10)

,product_id,product_name,category_id,price,stock_quantity,created_at
0,10,Calvin Klein T-Shirt,2,45.00,300,2026-01-23 07:35:22
1,16,The Great Gatsby,4,14.99,500,2026-01-23 07:35:22
2,19,The Midnight Library,4,15.99,350,2026-01-23 07:35:22
3,20,Clean Code,4,44.99,180,2026-01-23 07:35:22
4,23,Running Shoes Pro,5,129.99,80,2026-01-23 07:35:22
5,24,Camping Tent 4-Person,5,199.99,45,2026-01-23 07:35:22
6,25,Mountain Bike,5,599.99,25,2026-01-23 07:35:22
7,28,Perfume Collection,6,89.99,100,2026-01-23 07:35:22
8,29,Hair Dryer Pro,6,149.99,70,2026-01-23 07:35:22
9,30,Skincare Set,6,79.99,120,2026-01-23 07:35:22
10,32,PlayStation 5 Controller,7,69.99,150,2026-01-23 07:35:22
11,35,Remote Control Car,7,49.99,100,2026-01-23 07:35:22

## Problem 11: Subqueries ‚≠ê‚≠ê Medium

**Find all products that have a price higher than the average price of all products.**

In [88]:
# YOUR ANSWER HERE
query_11 = """
SELECT * FROM products
    WHERE price > (SELECT avg(price) FROM products)
"""
run_query(query_11)

,product_id,product_name,category_id,price,stock_quantity,created_at
0,1,iPhone 15 Pro,1,999.99,50,2026-01-23 07:35:22
1,2,Samsung Galaxy S24,1,899.99,45,2026-01-23 07:35:22
2,3,Sony WH-1000XM5 Headphones,1,349.99,100,2026-01-23 07:35:22
3,4,"MacBook Pro 14""",1,1999.99,30,2026-01-23 07:35:22
4,5,iPad Air,1,599.99,75,2026-01-23 07:35:22
5,12,KitchenAid Mixer,3,349.99,40,2026-01-23 07:35:22
6,13,Dyson V15 Vacuum,3,749.99,35,2026-01-23 07:35:22
7,25,Mountain Bike,5,599.99,25,2026-01-23 07:35:22

## Problem 12: Correlated Subquery ‚≠ê‚≠ê‚≠ê Hard

**For each category, find the most expensive product. Display the category name, product name, and price.**

In [89]:
# YOUR ANSWER HERE
query_12 = """

SELECT * from products 
WHERE price = (SELECT MAX(price) from products)

"""
run_query(query_12)

,product_id,product_name,category_id,price,stock_quantity,created_at
0,4,"MacBook Pro 14""",1,1999.99,30,2026-01-23 07:35:22

## Problem 13: CASE Statement ‚≠ê‚≠ê Medium

**Categorize all products based on their stock level:**
- 'Low Stock' if stock_quantity < 50
- 'Medium Stock' if stock_quantity between 50 and 150
- 'High Stock' if stock_quantity > 150

**Display product name, stock quantity, and the stock status.**

In [98]:
# YOUR ANSWER HERE
query_13 = """
SELECT
    product_name,
    stock_quantity,
    
CASE
    WHEN stock_quantity < 50 THEN 'Low Stock'
    WHEN stock_quantity BETWEEN 50 AND 100 THEN 'Medium Stock'
    ELSE 'High Stock'
END AS stock_level
FROM products
ORDER BY stock_quantity DESC
"""
run_query(query_13)

                  product_name  stock_quantity   stock_level
0             The Great Gatsby             500    High Stock
1                Atomic Habits             400    High Stock
2         The Midnight Library             350    High Stock
3         Calvin Klein T-Shirt             300    High Stock
4             Face Moisturizer             250    High Stock
5             Nike Air Max 270             200    High Stock
6          Python Crash Course             200    High Stock
7              Vitamin C Serum             200    High Stock
8          Monopoly Board Game             200    High Stock
9                   Clean Code             180    High Stock
10       Nintendo Switch Games             180    High Stock
11            Levi's 501 Jeans             150    High Stock
12            Yoga Mat Premium             150    High Stock
13    PlayStation 5 Controller             150    High Stock
14           Adidas Ultraboost             120    High Stock
15                Skincare Set             120    High Stock
16  Sony WH-1000XM5 Headphones             100  Medium Stock
17          Dumbbells Set 20kg             100  Medium Stock
18          Perfume Collection             100  Medium Stock
19          Remote Control Car             100  Medium Stock
20               Air Fryer Pro              90  Medium Stock
21           North Face Jacket              80  Medium Stock
22           Running Shoes Pro              80  Medium Stock
23                    iPad Air              75  Medium Stock
24              Hair Dryer Pro              70  Medium Stock
25             Instant Pot Duo              60  Medium Stock
26          LEGO Star Wars Set              60  Medium Stock
27           Nespresso Machine              55  Medium Stock
28               iPhone 15 Pro              50  Medium Stock
29          Samsung Galaxy S24              45     Low Stock
30       Camping Tent 4-Person              45     Low Stock
31            KitchenAid Mixer              40     Low Stock
32            Dyson V15 Vacuum              35     Low Stock
33             MacBook Pro 14"              30     Low Stock
34               Mountain Bike              25     Low Stock

## Problem 14: Date Functions ‚≠ê‚≠ê Medium

**Find all orders placed in January 2024. Display the order ID, customer full name, order date, and total amount.**

In [ ]:
# YOUR ANSWER HERE
query_14 = """

"""
run_query(query_14)

## Problem 15: Complex Analysis ‚≠ê‚≠ê‚≠ê Hard

**Create a customer analysis that shows:**
- Customer full name
- Total number of orders they placed
- Total amount spent
- Average rating they gave in reviews
- Only include customers who have placed at least 1 order

**Sort by total amount spent (descending).**

In [ ]:
# YOUR ANSWER HERE
query_15 = """

"""
run_query(query_15)

---
# ‚úÖ Answer Key
---

**‚ö†Ô∏è Try solving the problems yourself before looking at the answers!**

## Answer 1: Basic SELECT

In [ ]:
answer_1 = """
SELECT product_name, price
FROM products
ORDER BY price DESC;
"""
run_query(answer_1)

## Answer 2: Filtering with WHERE

In [ ]:
answer_2 = """
SELECT *
FROM customers
WHERE country = 'USA';
"""
run_query(answer_2)

## Answer 3: LIKE Operator

In [ ]:
answer_3 = """
SELECT *
FROM products
WHERE product_name LIKE '%Pro%';
"""
run_query(answer_3)

## Answer 4: Aggregate Functions (COUNT)

In [ ]:
answer_4 = """
SELECT COUNT(*) AS total_orders
FROM orders;
"""
run_query(answer_4)

## Answer 5: Aggregate Functions (SUM & AVG)

In [ ]:
answer_5 = """
SELECT 
    SUM(total_amount) AS total_revenue,
    AVG(total_amount) AS average_order_value
FROM orders
WHERE status = 'Delivered';
"""
run_query(answer_5)

## Answer 6: GROUP BY

In [ ]:
answer_6 = """
SELECT 
    c.category_name,
    COUNT(p.product_id) AS product_count
FROM categories c
LEFT JOIN products p ON c.category_id = p.category_id
GROUP BY c.category_id, c.category_name
ORDER BY product_count DESC;
"""
run_query(answer_6)

## Answer 7: HAVING Clause

In [ ]:
answer_7 = """
SELECT 
    c.first_name || ' ' || c.last_name AS full_name,
    COUNT(o.order_id) AS order_count
FROM customers c
JOIN orders o ON c.customer_id = o.customer_id
GROUP BY c.customer_id, c.first_name, c.last_name
HAVING COUNT(o.order_id) > 2;
"""
run_query(answer_7)

## Answer 8: JOIN Operations

In [ ]:
answer_8 = """
SELECT 
    c.first_name || ' ' || c.last_name AS full_name,
    o.order_date,
    o.status
FROM orders o
JOIN customers c ON o.customer_id = c.customer_id
ORDER BY o.order_date DESC;
"""
run_query(answer_8)

## Answer 9: Multiple JOINs

In [ ]:
answer_9 = """
SELECT 
    p.product_name,
    oi.quantity,
    c.email
FROM order_items oi
JOIN orders o ON oi.order_id = o.order_id
JOIN customers c ON o.customer_id = c.customer_id
JOIN products p ON oi.product_id = p.product_id;
"""
run_query(answer_9)

## Answer 10: LEFT JOIN

In [ ]:
answer_10 = """
SELECT 
    p.product_name,
    c.category_name
FROM products p
LEFT JOIN order_items oi ON p.product_id = oi.product_id
JOIN categories c ON p.category_id = c.category_id
WHERE oi.item_id IS NULL;
"""
run_query(answer_10)

## Answer 11: Subqueries

In [ ]:
answer_11 = """
SELECT product_name, price
FROM products
WHERE price > (SELECT AVG(price) FROM products)
ORDER BY price DESC;
"""
run_query(answer_11)

## Answer 12: Correlated Subquery

In [ ]:
answer_12 = """
SELECT 
    c.category_name,
    p.product_name,
    p.price
FROM products p
JOIN categories c ON p.category_id = c.category_id
WHERE p.price = (
    SELECT MAX(p2.price)
    FROM products p2
    WHERE p2.category_id = p.category_id
)
ORDER BY c.category_name;
"""
run_query(answer_12)

## Answer 13: CASE Statement

In [ ]:
answer_13 = """
SELECT 
    product_name,
    stock_quantity,
    CASE
        WHEN stock_quantity < 50 THEN 'Low Stock'
        WHEN stock_quantity BETWEEN 50 AND 150 THEN 'Medium Stock'
        ELSE 'High Stock'
    END AS stock_status
FROM products
ORDER BY stock_quantity;
"""
run_query(answer_13)

## Answer 14: Date Functions

In [ ]:
answer_14 = """
SELECT 
    o.order_id,
    c.first_name || ' ' || c.last_name AS full_name,
    o.order_date,
    o.total_amount
FROM orders o
JOIN customers c ON o.customer_id = c.customer_id
WHERE strftime('%Y-%m', o.order_date) = '2024-01'
ORDER BY o.order_date;
"""
run_query(answer_14)

## Answer 15: Complex Analysis

In [ ]:
answer_15 = """
SELECT 
    c.first_name || ' ' || c.last_name AS full_name,
    COUNT(DISTINCT o.order_id) AS total_orders,
    SUM(o.total_amount) AS total_spent,
    ROUND(AVG(r.rating), 2) AS avg_rating
FROM customers c
JOIN orders o ON c.customer_id = o.customer_id
LEFT JOIN reviews r ON c.customer_id = r.customer_id
GROUP BY c.customer_id, c.first_name, c.last_name
HAVING COUNT(DISTINCT o.order_id) >= 1
ORDER BY total_spent DESC;
"""
run_query(answer_15)

---
# üìö SQL Cheat Sheet
---

## Basic Syntax
```sql
SELECT column1, column2 FROM table_name;
SELECT * FROM table_name;  -- Select all columns
SELECT DISTINCT column FROM table_name;  -- Unique values only
```

## Filtering
```sql
WHERE column = value
WHERE column > value
WHERE column BETWEEN value1 AND value2
WHERE column IN (value1, value2)
WHERE column LIKE 'pattern%'  -- % = any characters
WHERE column IS NULL
WHERE column IS NOT NULL
```

## Sorting & Limiting
```sql
ORDER BY column ASC/DESC
LIMIT n
OFFSET n
```

## Aggregate Functions
```sql
COUNT(*), COUNT(column)
SUM(column)
AVG(column)
MIN(column), MAX(column)
```

## Grouping
```sql
GROUP BY column
HAVING condition  -- Filter groups
```

## Joins
```sql
INNER JOIN table2 ON table1.col = table2.col
LEFT JOIN table2 ON table1.col = table2.col
RIGHT JOIN table2 ON table1.col = table2.col
FULL OUTER JOIN table2 ON table1.col = table2.col
```

## String Functions (SQLite)
```sql
col1 || ' ' || col2  -- Concatenate
UPPER(column), LOWER(column)
LENGTH(column)
SUBSTR(column, start, length)
```

## Date Functions (SQLite)
```sql
strftime('%Y', date_column)  -- Year
strftime('%m', date_column)  -- Month
strftime('%d', date_column)  -- Day
DATE('now')  -- Current date
```

---
## üîí Clean Up

In [ ]:
# Close the database connection when done
conn.close()
print("‚úÖ Database connection closed!")